/* eslint-disable no-useless-escape */
/* eslint-disable security/detect-unsafe-regex */
// регулярка для проверки URL
const REGEX_URL = (/^(https?:\/\/)?([\da-z.-]+)\.([a-z.]{2,6})([\/\w.-]*)*\/?$/i);

// регулярка для токена: латинские прописные и заглавные, точка и тире
const REGEX_JWT = (/[a-z0-9\.\-]/i);

/* регулярка для пароля:
(?=.*[0-9]) - хотябы одна цифра
(?=.*[!@#$%^&*]) - спецсимволы
(?=.*[a-z]) - хотябы одня прописная латинская буква
(?=.*[A-Z]) - минимум одня заглавная латинская буква
[0-9a-zA-Z!@#$%^&*]{8,} - диапазон всех перечисленных букв и символо не менее 8
*/
// const REGEX_PASSWORD = (/^(?=.*[A-Za-z])(?=.*\d)(?=.*[@$!%*#?&])[A-Za-z\d@$!%*#?&]{8,}$/);
const REGEX_PASSWORD = (/^(?=.+[0-9])(?=.+[!@#$%&-_])(?=.*[A-Z])(?=.*[a-z])[a-zA-Z0-9!@#$%&-_]{8,}$/);

// регулярка для проверки ID
const REGEX_ID = (/[a-z0-9]{24}/i);
/* const REGEX_EMAIL = (/(?:[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\.
  [a-z0-9!#$%&'*+/=?^_`{|}~-]+)*|"(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21\x23-\x5b\x5d-\x7f]|
    \\[\x01-\x09\x0b\x0c\x0e-\x7f])*")@(?:(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)
    +[a-z0-9](?:[a-z0-9-]*[a-z0-9])?|\[(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)
    \.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?|[a-z0-9-]*[a-z0-9]
      :(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21-\x5a\x53-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])+)\])/);
*/

module.exports = {
  REGEX_URL,
  REGEX_JWT,
  REGEX_PASSWORD,
  REGEX_ID,
};
